{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Traces",
	"language": "en",
	"home_page_url": "https://senestres.github.io/adaptive-movement/adaptive-movement/",
	"feed_url": "https://senestres.github.io/adaptive-movement/feed/feed.json",
	"description": "Skill acquisition and movement education",
	"author": {
		"name": "Yann Daout",
		"url": "https://senestres.github.io/adaptive-movement/about/"
	},
	"items": [
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-3/",
			"url": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-3/",
			"title": "Can we teach creativity ? (part 3)",
			"content_html": "<p>After teaching a few classes on creativity, I’ve come across a few more ideas, so take this as a short addendum to my <a href=\"https://adaptivemovement.net/can-we-teach-creativity-part-1/\">creativity articles</a>. I might update it from time to time. This will be more focused on parkour, but the ideas might apply to other sports.</p>\n<h1 id=\"how-can-we-make-creativity-less-abstract\" tabindex=\"-1\">How can we make creativity less abstract ? <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-3/\">#</a></h1>\n<p>One question I’ve been asking myself is how to make creativity less abstract. If I want my students to focus on the creativity of their lines, rather than say, speed, using the shorthand « be creative » would be useful. The problem is that everybody understands what going fast means, but being creative is less clear. So how can we put more flesh on that idea ? One solution I’ve come up with is to start talking about emotions. Because being creative means novelty, it can bring negative emotions like the fear of trying something new ; but also positive emotions when you achieve that novelty. The most specific emotion seem to me to be surprise : surprise that something is achievable ; surprise that nobody has thought about <em>that</em> until then ; surprise that you can use <em>this</em> environment in <em>that</em> way. So let’s say you start instructing your students to create a line with the aim of surprising the other members of the group. That should be a nice emotional constraint. After a few times, there should be enough flesh on the concept of creativity to start using the shorthand.</p>\n<h1 id=\"can-we-use-more-complex-constraints\" tabindex=\"-1\">Can we use more complex constraints ? <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-3/\">#</a></h1>\n<p>I think most practitioners would benefit from very simple constraints. But as an additional challenge, or just to add variety to training, more complex constraints can be used.</p>\n<p>Maybe we can make more use of emotional constraints, like “do something that scares you”, “something that makes you happy”, etc. More generally we could invite our students to put themselves in the skin of a character to promote creativity. “Move like it’s the first thing you do in the morning and you’re not fully awake yet” or “move like you’re drunk” can end up creating pretty creative and funny parkour lines.</p>\n<p>Elias Borrajo has talked about using patterns of constraints. Let’s say every second “move” has to be done with both hands, and every third move has to be done with only one foot. You’ll end up with a criss-cross of constraints, sometimes you need to satisfy one or the other, sometimes both at the same time, sometimes none.</p>\n<p>I’m not sure who to attribute this idea to, but maybe it was Elias too: every time you use one hand, you need to turn left; every time you use both hands, you need to turn right. This constraint works both ways. It either pushes you in a region of the environment that you were not aiming to go to, forcing you to explore it; or if you have somewhere you want to go, you really need to think of the sequence of moves that will get you there.</p>\n<p>Another interesting constraint comes from Sébastien Sevino and Tristan Bana. Take a set of obstacles, and create a line with a certain sequence of techniques. Once it has been memorized, just move to different obstacles, and try to do the same line, using an identical sequence of techniques, <em>mutatis mutandis</em>. This forces you to explore in order to find ways to apply the same techniques on very different obstacles, and requires to adapt and think outside the box.</p>\n<p>As you can see, creativity is nested. In order to promote motor creativity, teachers need to be creative about the exercises, games and constraints they use. I hope we can make this part of creativity a collective endeavour, because I clearly have learned a lot from interacting with other teachers.</p>\n",
			"date_published": "2022-10-27T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/",
			"url": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/",
			"title": "Can we teach creativity ? (Part 2)",
			"content_html": "<p>In the <a href=\"https://senestres.github.io/adaptive-movement/can-we-teach-creativity-part-1\">first part</a>, I suggested that in the context of motor learning, it would be profitable to move aways from thinking of creativity as ideation, i.e. thinking new ideas that can then be put into actions.</p>\n<p>Rather, these are fruitful ways of thinking about creativity:</p>\n<ol>\n<li>It can be defined as developing new functional behaviours, and/or acting in functional ways in novel situations.</li>\n<li>Constraints and randomness can be useful tools for creativity.</li>\n<li>We need to keep in focus the interactions between the body and its environment.</li>\n</ol>\n<p>Maybe this is not the full picture, but I think it gets us a long way, so here are a few ideas to teach creativity, or at least structure classes in order to see the emergence of creative motor solutions.</p>\n<p><strong>Developing effectivities</strong>: in order to perceive and use affordances, individuals need to have some corresponding capacities, called effectivities<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[1]</a>. Having a bigger repertoire of techniques, being strong and flexible, etc. will allow the individual to act on more of the affordances. In fact, the link seems tighter than this phrasing suggests: it’s harder to perceive the climbability of a wall when you’re not capable of climbing it. And if you’ve mastered the wallrun, a wall can be perceived as climbable even if there are no holds to be found<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[2]</a>.</p>\n<p><strong>Observing affordances for others</strong>: although there is a tight link between affordances and effectivities, it isn’t perfect, or we wouldn’t be able to learn by observing somebody else. If you see the wall as climbable for somebody else, it might suggest climbability for you, at least after a bit of training. There are different ways of using this insight, and one of them would be to structure your classes in a way that allows students to learn from each other. For example, you could ask every student to show to the others how they would solve a particular problem.</p>\n<p><strong>Seizing affordances in action</strong>: motor creativity doesn’t come from sitting down until you suddenly get a new idea. It comes during movement and action, while actively exploring an environment. A good example is when the gap between two walls feels “jumpable” only once you have the right run-up. Creative solutions emerge when faced with a new situation, looking at a problem from a (literal) different point of view, etc.</p>\n<p><strong>Compromise between structure and exploration</strong>: neither repetitive drills nor unguided discovery foster creativity, at least when used exclusively. Try to find the right balance for your students. If you throw your students immediately in a complex environment with no prescribed goal, they’ll feel lost. But at the end of a training session, when they feel familiar with the possibilities of the environment and know of a few techniques or principles that they can try to apply on their own, it might be worth it to let them work with minimal instructions. Games usually work well to balance between structure and freedom. There can be rules and specific goals, the environment can be structured to facilitate some behaviours more than others, but they still allow for exploration, coming up with your own solutions, and because they unfold over time, there’s a need for constant adaptation.</p>\n<p><strong>Destabilize attractors</strong>: if you focus your students on a specific technique that you prescribe, they’ll try to match that and there won’t be a lot of creative solution. A better way is to set a task without giving a solution. If the students end up doing always the same thing, introduce new constraints that necessitate the reorganisation of behaviour and move them away from these attractors. Try to find tasks that are sufficiently difficult so that practitioners need to make use of all available affordances, explore different possibilities, or even take a step back, think and observe the details of the environment. In one sentence: design learning situations that promote the need to seek for new and/or various solutions.</p>\n<p><strong>Foster a welcoming climate</strong>: there should be an atmosphere where experimenting has minimal negative consequences. Don’t put too much stress on attaining a perfect technique, except for obvious safety reasons. Don’t punish errors, give positive instead of negative feedback. Sometimes it is a good idea to state clearly that there are more than one way of attaining an objective. We tend to forget that movement solutions emerge in a social environment too; and you can’t be surprised if your students all go for the same solutions if that’s what they see on Instagram, if they know you’ll say disapproving comments if their technique is not perfect, if they suppose that there is only one good solution and another member of the group has already shown a fitting one.</p>\n<p>To give a bit more flesh to these ideas, here are a few tasks in parkour that while very basic, should allow for the emergence of creative solutions:</p>\n<ul>\n<li>“Find X different ways of overcoming this obstacle”</li>\n<li>“Do a cat leap in X different places”</li>\n<li>“Follow another practitioner and imitate his movements”</li>\n<li>“Move without slowing down in a tight and cluttered space, for 30s”</li>\n<li>“Try to link these two unrelated movements in a fluid manner”</li>\n<li>“Imagine yourself executing the most absurd or seemingly impossible movements.”</li>\n<li>“Overcome this sequence of obstacles at different speeds”</li>\n<li>“Add to your predecessor’s sequence of movement, without using the same technique twice”</li>\n</ul>\n<p>You could even use some randomness, for example with the Ukemi game<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[3]</a> which allows to pick movement sequences from a pile of cards. Of course, you can build your own card game, or just use dice and a numbered list of moves.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">#</a></h2>\n<p>There are two important lessons here: creativity can actually rely on structure and constraints; and creativity happens in interaction, rather than just by staring at a piece of paper. Creativity is a complex topic, and this article is tentative at best. In a sense, an article like this can teach you <em>about</em> creativity, but can only have limited success in teaching creativity itself. In the same way, the methods I suggested foster creativity in the specific sense of motor creativity:  the emergence of rare, unusual and new movement patterns. But this is probably not the same as taking creativity as a transferable skill, say from acquiring new moves in basketball to being a genius painter. Creativity is not a “thing” in itself, and you sure don’t have a creativity module in your brain. Maybe the most transfer we can get is when we use these methods and concepts, like the use of constraints or randomness, and apply them to different domains.</p>\n<hr>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[1]</a> Chemero, A., Radical embodied cognitive science, MIT press, 2009.</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[2]</a> Taylor, J. E., Witt, J. K., &amp; Sugovic, M. (2011). When walls are no longer barriers: perception of wall height in parkour. Perception, 40(6), 757–760.</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-2/\">[3]</a> <a href=\"https://ukemi.ninja/projects/ukemi-card-game\">https://ukemi.ninja/projects/ukemi-card-game</a></p>\n",
			"date_published": "2022-08-02T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/",
			"url": "https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/",
			"title": "Can we teach creativity ? (Part 1)",
			"content_html": "<p>We tend to think of creativity as the generation or apparition of new ideas, which can then be put into action. I call this “ideation”. This view of creativity is probably so strong because we take our paradigmatic examples of creativity in specific domains like scientific or technological innovation, writing novels or creating music. But when we focus on activities that are not usually framed as being purely intellectual, like parkour, this two step process, inventing ideas in your head, then applying them to the world, might not work that well. It misses the tight link between action and perception, the direct interaction of the body and the environment.</p>\n<p>Here, I want to pursue this line of thinking, which is very relevant for teaching creativity in sports and physical activities. I will argue that we need to move a few steps away from the ideation approach if we want to understand motor creativity. Using the frameworks of ecological-dynamics, we can understand how using constraints can benefit creativity. In <a href=\"https://senestres.github.io/adaptive-movement/can-we-teach-creativity-part-2\">part 2</a>, I will explore a few methods and principles to promote the emergence of creative motor solutions.</p>\n<h2 id=\"cognitive-and-motor-creativity\" tabindex=\"-1\">Cognitive and motor creativity <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">#</a></h2>\n<p>In a blog post, Philipp Holzmüller<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[1]</a> showed that creativity in parkour is not only about coming up with new moves or finding a solution to a challenge (how do I climb here ?), but also in setting up the challenge for yourself (let’s try to climb here), and even in identifying the right location to train in the first place. In that sense, creativity happens at different levels. We could think of it as a spectrum, ranging from cognitive to motor creativity. Setting yourself some new and interesting challenges would be at the cognitive end, and developing new patterns of movement that help solve these challenges would be at the motor end. This spectrum is useful for a start, but we must be careful with it. I’m sure most of us don’t always sit down with pen and paper, thinking hard and taking notes on what challenges we want to invent; rather, it is often the environment that suggests challenges: this wall feels climbable, let’s try to climb it. There is always more interaction between the body and the environment that this clean spectrum suggests. And we should avoid making a strict dichotomy between pure thinking (cognition) and pure behaviour: moving our bodies is arguably cognitive. But thinking of this spectrum is a useful start, and will come handy in the next section.</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/images/Untitled-Diagram.jpg\" alt=\"\"></p>\n<p>So that being said, what is motor creativity ? Orth et al. give a definition that is very useful for our purposes: motor creativity is the capacity to develop new functional behaviours, and/or to act in functional ways in novel situations<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[2]</a>. The “novelty” part of the definition can be relative to the individual, or to a group<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[3]</a>. So being creative in parkour could mean finding a new pattern of movement that allows me to overcome an obstacle; and “new” could mean that I never used it, or that nobody in my local community has ever done that. But it could also mean using that pattern in an environment I am not familiar with, for example trying a kong on a rail instead of the walls I usually train on. So here creativity is not necessarily measured by the apparition of new ideas, but with new behaviours or the adaptation of behaviour to new environments. To clarify, this definition  moves us away from the act of Creation with a big C, to the simple apparition of statistically rare patterns of movement.</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/images/What-else-in-stead-of-kong-1024x750.jpg\" alt=\"\"></p>\n<p>What else than a kong ? (picture by Pawel van der Steen)</p>\n<p>This is useful, because it allows for a less top-down approach. Instead of ideas prescribing movement, like a boss giving orders, we can use the more bottom-up approach from ecological-dynamics, where movement is self-organized. Sure, we set goals and intentions ourselves, but movement patterns emerge from the interaction of the body and the environment. Therefore, new movement patterns can arise when there are changes in the configuration of constraints from the body, the environment or the task. And if that is the case, teachers have a powerful methodological tool to foster the emergence of creative solutions: the manipulation of constraints.</p>\n<h2 id=\"constraints-and-creativity\" tabindex=\"-1\">Constraints and creativity <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">#</a></h2>\n<p>At a first glance, creativity and constraint might seem antinomic. We think of creativity as being “free”: obeying orders, following rules, applying a plan, repeating an action or imitating somebody else are not cases that we usually call “being creative”. From that perspective, it is not immediately obvious that creativity is a skill that can be taught. Maybe with experience, you can become creative, but it doesn’t seem to be something that you can transfer from person to person as easily as “knowledge” or “rules”. Think of the “stroke of genius” paradigm: creativity is just ideas coming from… nowhere ? But the CLA takes us away from the generation of ideas to focus on the emergence of new behaviours; and will explain this emergence by the interaction of the different constraints of the situation<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[4]</a>. And in this paradigm, constraints are not only limiting, but also enabling. They shape and guide the self-organisation of movement.</p>\n<p>Of course, using constraints for creativity is not something new, in fact there is a long tradition of constrained creative endeavours. We could examine the multiple forms of constrained writing, the most obvious one being poetry, with its use of structures and patterns. Constraints are sometimes explicitly used as engines for creativity and imagination like in the OuLiPo (“ouvroir de littérature potentielle”) group. The most famous example is probably George Perec’s <em>La Disparition</em>, written without using the letter “e”. And constraints probably appear everywhere in less systematic and explicit manners. Umberto Eco says that before writing <em>The Name of the Rose</em>, he had notes on all of the monks of his fictitious monastery, even those he would never mention in the book. The story that would emerge was already constrained by these imaginary characters.</p>\n<p>Let’s get closer to what interests us here: creativity in movement. Starting with dance is probably a good idea, because it is more obviously a creative endeavour than most sports.  Even in dance, numerous examples of constraints can be given, like the structure of the music. But the most interesting examples are when choreographers use constraints in a systematic fashion, like some of Merce Cunningham’s methods, who used to throw dice or coins to construct sequences of movements.  To be fair, it might seem like this is not a matter of creativity after all. Throwing a dice can take care of the <em>sequence</em> of movements, but somebody still had to come up with the <em>individual</em> movement patterns. But now take two dice, say one for each arm. Sure, you need to input something (a movement pattern, a direction, etc.) for each number of the dice. But new patterns of movement will emerge from the random combinations of left and right arm. In some cases, they might even seem impossible to execute in a straightforward fashion, and will require experimentation and push the self-organisation of the dancers in new directions. Cunningham said that &quot;if a dancer tells me that something won't work, I say, Try it; if you fall down, you'll find something about falling down&quot;<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[5]</a>.</p>\n<p>In a sense, these methods allow to displace ideation, to move between the different levels of creativity: you need to have the idea of setting up constraints, like using randomness for creative purposes in the first place, but after that it’s not a matter of coming up in your mind with the sequence of movement. Once the dice is thrown, you have to go with it: <em>alea jacta est</em>. Randomness and self-organisation take care of the motor aspect of creativity. I can’t go into all the factors that make constraints useful for creativity. There certainly is a motivational aspect: seeking to satisfy these constraints sets an interesting challenge for yourself. They also restrict the state-space, creating problems that are better defined and easier to answer<a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[6]</a>. In this way, they help solve the degrees of freedom problem: your body can move in a potential infinity of ways, but this is not the case when faced with a specific environment and a goal to attain; the constraints do some of the work of “selecting” which patterns of movement are used. And as we’ve seen, constraints can also push us away from obvious solutions, confronting us to new situations, forcing experimentation and adaptation.</p>\n<p>Finally, two concepts seem important to help us think about motor creativity: affordances and attractors. Affordances are the opportunities for movement offered by the environment: a chair affords sitting, a handle affords gripping, etc. A good deal of creativity comes from discovering these affordances, like finding out that you can use a rebound instead of a direct shot or that a wall is climbable. Attractors are the stable patterns of movement in a given situation, like running on a fast treadmill or walking on a slower one. If an attractor is strong, all behaviour will tend to gravitate towards it, and there will be low variability of movement. For example, if you feel very comfortable with one kind of movement, you will tend to always use that technique, and not explore other solutions. With those concepts in mind, the question of creativity becomes: how can we discover and use diverse affordances ? and how can we move away from strong attractors in order to get more variable movement ? These are questions I want to answer in the <a href=\"https://senestres.github.io/adaptive-movement/can-we-teach-creativity-part-2\">second part</a>, while suggesting different concrete ways of teaching creativity.</p>\n<hr>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[1]</a> <a href=\"https://thoseguysparkour.wordpress.com/2020/01/19/parkour-the-art-of-finding-problems/\">https://thoseguysparkour.wordpress.com/2020/01/19/parkour-the-art-of-finding-problems/</a></p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[2]</a> Orth Dominic, Kamp John van der, Memmert Daniel <em>et al.</em>, « Creative Motor Actions As Emerging from Movement Variability », <em>Frontiers in Psychology</em> 8, 2017.</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[3]</a> Ibid.</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[4]</a> Ibid.</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[5]</a> Cohan Robert P., Vaughan David et Cunningham Merce (éds), <em>Merce Cunningham: creative elements</em>, 2. printing, New York, NY, Harwood Academic Publishers, 1999 (Choreography and dance).</p>\n<p><a href=\"https://senestres.github.io/adaptive-movement/blog/can-we-teach-creativity-part-1/\">[6]</a> Warburton Edward, « Imagine the (Im)possibilities: The Role of Constraints on Dance Creativity », <em>Dance: Current Selected Research</em>, 2018.</p>\n",
			"date_published": "2022-08-02T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/can-my-dog-predict-the-future/",
			"url": "https://senestres.github.io/adaptive-movement/blog/can-my-dog-predict-the-future/",
			"title": "Can my dog predict the future ?",
			"content_html": "<p>When I throw a stick, my dog starts moving before the stick even leaves my hand. How is that possible ? Does my dog know the future ? Of course, beyond the joke and the clickbaity title, this should not seem like magic. We usually admit that animals can anticipate by predicting the future, at least in some weak sense. I suppose we think of it like this: my dog has observed me throwing toys for years, so he has a mental model of where the toy will go depending on my movements. When I start moving, his brain uses the present information, puts it in the model, makes a few computations, predicts the trajectory of the stick, and starts moving according to this prediction. And sure, this is far from being Nostradamus. I can profit from this behaviour to easily fool my dog. I simply don’t release the stick, and my dog starts moving to the wrong place.</p>\n<p>We have a tendency to say that dogs predict the trajectory of their toy, even though they can make bad predictions from time to time. And this seems necessary, even obvious, because dogs need to be at a certain place in the future to be able to catch the toy. But this future-position-of-the-toy is not available in the present, at the time when the dog needs to start moving. Prediction is necessary, then, because dogs can only use the information available in the present, and obviously this is not sufficient for knowing the future. It is a typical example of what Andy Clark and Josefa Toribio ((Clark, A., &amp; Toribio, J. (1994). Doing without representing? <em>Synthese</em>, <em>101</em>(3), 401–431.)) have called “representation-hungry” problems: it seems like it can't be solved without using mental representations. But because there are regularities in the physics of toy-throwing, it is possible to have a model that relates present information to future toy positions.</p>\n<h2 id=\"anticipation-without-prediction\" tabindex=\"-1\"><strong>Anticipation without prediction</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-my-dog-predict-the-future/\">#</a></h2>\n<p>But is it that obvious ? Let’s change the perspective a bit. Instead of doing an overhead throw, let’s swing the stick from side to side. My dog still makes the same kind of anticipation: when I swing left, he moves left. When I swing right, he moves to the right. But this allows to recognize that maybe he’s not making a prediction at all. He is just coupled to the stick, always following it when I swing it. If I don’t release the stick, he ends up being wrong, but not because of his lack of predictive skills, simply because the information to which he adjusts his movement has changed. There is no need here for a complex mental model simulating toy-ballistics. In fact, no knowledge about the future is required, just the visual information available in the present.</p>\n<p>Surely this is an exception, right ? If I really throw something, my dog needs to be able to predict where it’s going to land. Well, not according to research. In 2004, researchers((Shaffer, D. M., Krauchunas, S. M., Eddy, M., &amp; McBeath, M. K. (2004). How Dogs Navigate to Catch Frisbees. <em>Psychological Science</em>, <em>15</em>(7), 437–441.)) attached cameras to the heads of two dogs (Lilly and Romeo) in order to observe their strategies while catching Frisbees. If they were using a predictive strategy with a mental model, they should run in a straight line to the landing point, and then wait if they’re early enough. In fact, they use a strategy focusing on constantly adjusting their movement to the flight of the Frisbee. Basically they try to maintain an optical image of the Frisbee so that it seems to be flying in a straight line with constant speed. This is called a <em>prospective</em> strategy, rather than a <em>predictive</em> one. The details are a bit complex to put into words, so go read the paper if you want to know more. I’ll just try to give you a sense of how that can work. Imagine the parabolic trajectory of a ball moving towards a dog. From his point of view, it seems to go up, slow down, then speed back down. If the dog moves in a way that cancels this perceived acceleration, he’ll be at the right place at the right time. Add other tricks analogous to this one, depending on the situation, and dogs are capable of catching objects without using prediction.</p>\n<p>At a first glance, maybe we attribute predictive capacities to dogs because we’re guilty of anthropomorphism. We attribute our “higher” cognitive skills and behaviours to animals. This probably happens more often than not ((Barrett, L. (2015). <em>Beyond the Brain: How Body and Environment Shape Animal and Human Minds</em>. Princeton University Press.)). But in fact we are not that superior, and in this case we would be as wrong if we attributed prediction to humans. There is a large body of research, centred on the “outfielder problem” ((e.g. Fink, P. W., Foo, P. S., &amp; Warren, W. H. (2009). Catching fly balls in virtual reality: A critical test of the outfielder problem. <em>Journal of Vision</em>, <em>9</em>(13), 14–14; McBeath, M. K., Shaffer, D. M., &amp; Kaiser, M. K. (1995). How baseball outfielders determine where to run to catch fly balls. <em>Science</em>, <em>268</em>(5210), 569–573.)), that shows that we use the same strategies as Lilly and Romeo in order to catch objects. This is something we should celebrate. By “using the world as its own model” ((Brooks, R. A. (1991). Intelligence without Reason. <em>Proceedings of 12th Int. Joint Conf. on Artificial Intelligence</em>, 569–595.)), we can avoid using a superfluous, imperfect, time- and energy-consuming internal model. The couplings solutions we use have a huge advantage, because they’re always up to date, they can be applied to balls as well as less predictable objects like Frisbees, and work within a large range of conditions, taking wind or friction into account. My dog can’t predict the future, but he doesn’t need to.</p>\n<h2 id=\"keeping-them-coupled\" tabindex=\"-1\"><strong>Keeping them coupled</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/can-my-dog-predict-the-future/\">#</a></h2>\n<p>Dogs and humans can anticipate the future without using prediction, by coupling their movements to available information in the environment. This has strong implications for the way we teach sports. When teaching skills that require some form of anticipation, the goal should not be to create internal models that allow predicting outcomes, e.g. the trajectory of the ball. What we want is rather to create functional couplings between the body and the ball. At some point, the teaching methods used for these goals will diverge: the second option requires the athlete to move and adapt in real time. No decontextualized and repetitive drill or watching of an opponent on a screen will suffice. Once again, we need to keep perception and action together.</p>\n",
			"date_published": "2021-03-01T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/",
			"url": "https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/",
			"title": "Why we need variability of movement",
			"content_html": "<p>When it comes to producing skillful sport performance, we tend to think that we need to achieve a very consistent way of moving. In that perspective, less movement variability means better performance. This comes from a common assumption that consistent performance is an essential element of skill. But there are two components of performance: the movement, and the outcome. Traditional teaching methods focus on the movement, with ideal patterns that have to be learned, rehearsed, and reproduced. We therefore tend to treat deviations as errors, that come from some kind of lack of control. Here we will challenge these assumptions by focusing on the consistency of outcome. We will argue that variability is a necessary component of movement, allowing for better control, adaptability and learning. If we want consistent outcomes, we need variability of movement.</p>\n<p>In this article, we will leave out of the discussion activities with aesthetic elements, like gymnastics or dance, where it is not obvious that there is an outcome separate from the movement itself. In these activities, the patterns of movement matter in a more direct fashion than say, football or athletics, so we will examine them in another article.</p>\n<h2 id=\"variability-is-omnipresent\" tabindex=\"-1\"><strong>Variability is omnipresent</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/\">#</a></h2>\n<p>To start, let us state the simple fact that variability of movement is everywhere, while not seeming to hinder our capacity to move with precision and efficiency. Even when rehearsing a technique, every attempt will look a bit different. A bit more speed, a bit less flexion at the knee. But luckily this does not make us incapable of attaining our objectives. While studying expert blacksmiths, the Russian neurophysiologist Nikolaï Bernstein remarked that the trajectory of the arm and the hammer where very different from strike to strike, while the blacksmiths were still capable of striking with precision. Bernstein coined the phrase “repetition without repetition”((Bernstein N, « On dexterity and its development », in: Latash Mark L. et Turvey Michael T. (éds), <em>Dexterity and its development</em>, Mahwah, N.J, L. Erlbaum Associates, 1996.)) : the blacksmiths were repeating the same gesture, but the patterns of movement were not identical. Because we move in complex and dynamical environments, every trial and every task are different. That our actions have some variability is therefore something we should expect. We struggle with repetitive and stereotypical movements, and they can be a sign of pathology, like in Parkinson’s disease((Davids K., Button Chris et Bennett Simon, <em>Dynamics of skill acquisition: a constraints-led approach</em>, Champaign, IL, Human Kinetics, 2008.)). This is also linked to what we call the <a href=\"https://senestres.github.io/adaptive-movement/the-dynamical-systems-approach\">degrees of freedom</a> problem: we have so many different ways of moving available to us, how do we select one specific solution among them ?</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/images/Cyclogram.jpg\" alt=\"\"></p>\n<p>Hammer strike cyclogram</p>\n<p>Let’s keep this in mind: the trajectory of the strike of the blacksmiths was variable, but the endpoint was not. Results should be invariant, but this does not require invariable movements. Let’s take another example: in ping-pong, the variability of the position of the paddle is quite high at the beginning of the movement, in order to adapt to the position of the ball((Bootsma Reinoud J. et Wieringen Piet C. W. van, « Timing an attacking forehand drive in table tennis », <em>Journal of Experimental Psychology: Human Perception and Performance</em> 16 (1), 1990, pp. 21‑29.)). But the variability gets really small at the moment of the strike, because that is the moment when precision is essential. If this still seems a bit alien to you, let’s go into why this might happen and see if we can make it sound reasonable.</p>\n<h2 id=\"variability-allows-for-adaptation\" tabindex=\"-1\"><strong>Variability allows for adaptation</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/\">#</a></h2>\n<p>As we’ve already alluded to, there is some variability in the environments we interact with. We also have to face internal variability (usually called “noise”): this might come from factors like fatigue or the imperfection of transmissions in our nervous system. This means there cannot be a 1:1 relationship between plans of movements in our heads, and their executions. Some variability will happen eventually.</p>\n<p>If we accept this, then there must be some way that we compensate for this internal and external variability. Take the blacksmiths: the only way they could use the same pattern of movement each time was if their arms were in the same starting position before every strike. But this would be very hard to do, because when they strike, the hammer rebounds in different ways on the surface. So they need some variability of movement to compensate for the noise, errors and uncontrolled rebounds. The arm takes different trajectories because it doesn’t always start at the same point, but the blacksmith still wants to keep the strike end-point constant. Let’s take another example: you’re trying to figure out your run-up in order to jump from a take-off board((Montagne Gilles, « Le contrôle des mouvements finalisés en sport », <em>Bulletin de psychologie</em> Numéro 475 (1), 2005, pp. 7‑10.)). If you keep your stride length constant, you probably won’t end up with your foot on the board. In order to do that, you have to constantly adapt your stride length to your speed, and compensate for unpredictable factors like the wind, your fatigue, etc. One part of the system varies, so other parts must adapt to keep a precise and stable result. I call this the “funnel” model (see graph).</p>\n<p><img src=\"https://lh6.googleusercontent.com/w3A2xztXqlj9otRpBWRLNMAvQ9qcs_rv6u3OqZeabXJeu-wusCEYakifNA-CzJ9KOzP2-ZcqJMDbK1fN9FvBnjdHLV5ddHykehWsPq695EUCC5yVA4SXXlxgb6-c4GZW8MopbDCq\" alt=\"\"></p>\n<p>Two models of variability</p>\n<p>This means that variability makes our movements more flexible and adaptable. It helps to compensate for internal (fatigue…) and external (wind…) changing factors. It allows us to attain our goals consistently in complex, changing and unpredictable contexts. It allows to react to perturbations and have alternative solutions at hand in cases of uncertainty. Let’s say your shoulder is injured: it would be better to perform using more of the elbow and less of the shoulder. Or the opponent you’re facing is uniquely tall: if you’re not able to adapt the trajectory of your throws, you won’t be very helpful for your team. In the blacksmith example, variability might also be functional to avoid overuse injuries, by putting muscles and joints into play differently at each strike.</p>\n<p>The idea of the single ideal pattern of movement can also be put into question because it doesn’t seem like a very efficient strategy of controlling our movements. Think of it this way: your main goal is to strike the hammer with precision at the endpoint. Insuring that the trajectory is precise too is like adding a separate subgoal. Allowing for variability and flexibility is better, because it allows to put the maximum resources (attention, energy, etc.) into actually attaining our goals consistently, rather than attaining our goals while at the same time ensuring that our movements look the same((Liu Dan et Todorov Emanuel, « Evidence for the Flexible Sensorimotor Strategies Predicted by Optimal Feedback Control », <em>Journal of Neuroscience</em> 27 (35), 2007, pp. 9354‑9368.)). Variability does not come from errors or lack of control: it comes from an optimal control strategy. Variability is tolerated as long as it does not interfere with task success. It might help to think of this as a way of solving the degrees of freedom problem: motor control is simplified because we don’t need to control every single independent element. Some can be left to vary and compensate for the variability of others. Only the global results matters. As Mark Latash puts it: “We are blessed with abundance [of movement solutions]; so, let us not waste time trying to eliminate it.”((Latash Mark L., « The bliss (not the problem) of motor abundance (not redundancy) », <em>Experimental Brain Research</em> 217 (1), 2012, pp. 1‑5.))</p>\n<h2 id=\"variability-can-enhance-learning\" tabindex=\"-1\"><strong>Variability can enhance learning</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/\">#</a></h2>\n<p>There is also some evidence that variability improves learning. A study has shown that learners with a higher level of variability learned faster than those with lower variability((Wu Howard G., Miyamoto Yohsuke R., Castro Luis Nicolas Gonzalez <em>et al.</em>, « Temporal structure of motor variability is dynamically regulated and predicts motor learning ability », <em>Nature Neuroscience</em> 17 (2), 2014, pp. 312‑321.)). There is also an experimental method called differential learning((Schöllhorn Wolfgang Immanuel, Beckmann Hendrik, Janssen Daniel <em>et al.</em>, « Stochastic perturbations in athletic field events enhance skill acquisition », in: Renshaw Ian, Davids K. et Savelsbergh Geert J. P. (éds), <em>Motor learning in practice: a constraints-led approach</em>, 1st ed, London ; New York, Routledge, 2010, pp. 69‑82.)), which was also shown to be pretty effective for motor learning. The basic idea of this method is that every trial is done with a random variation of the movement (right arm at 45°, left leg extended, etc.). There is no repetition or reproduction of an ideal model and no feedback or demonstration, but still, the learners improve their performance. We can see variability as a sign of exploration of different movement solutions, while low variability can mean being stuck in inefficient or inflexible solutions.</p>\n<p>Brisson et al. have also shown that sometimes it’s not even possible to identify an optimal pattern of movement for a certain task((Brisson T. A. et Alain C., « Should Common Optimal Movement Patterns Be Identified as the Criterion to Be Achieved? », <em>Journal of Motor Behavior</em> 28 (3), 1996, pp. 211‑223.)). And when they compared learning by trying to emulate the pattern of the subject with the best results, versus trying to reproduce the pattern you used in your previous personal best attempt, the results were slightly better in the second case.  In another study, Brisson et al. showed that you don’t necessarily need to identify optimal patterns of movement to give useful feedback to learners ((Brisson Therese A. et Alain Claude, « Optimal Movement Pattern Characteristics are Not Required as a Reference for Knowledge of Performance », <em>Research Quarterly for Exercise and Sport</em> 67 (4), 1996, pp. 458‑464.)). When given information about the way they performed and of their results, they were able to explore different patterns and discover those that gave them the best results. It is not obvious then that we should try to imitate the patterns of expert athletes.</p>\n<h2 id=\"what-are-the-implications\" tabindex=\"-1\"><strong>What are the implications ?</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/\">#</a></h2>\n<p>With all the above, we should now understand that prescribing precise and stereotypical movement solutions risks being over constraining. Let’s say you insist that your learners run with a precise stride length: there will be a trade-off, where being precise while running will require compensatory variability and might diminish precision at the take-off board (the end-point). I would call this the “sieve” model (see graph), for lack of a better term. And if you give your learners a strict pattern to imitate, there will be less exploration, and therefore less chance to find novel solutions. This has consequences for the flexibility and adaptability of movement, and maybe for creativity too((Santos Sara, Coutinho Diogo, Gonçalves Bruno <em>et al.</em>, « Differential Learning as a Key Training Approach to Improve Creative and Tactical Behavior in Soccer », <em>Research Quarterly for Exercise and Sport</em> 89 (1), 2018, pp. 11‑24.)).</p>\n<p>I would advocate for a principle of minimal intervention((Todorov Emanuel et Jordan Michael, « A Minimal Intervention Principle for Coordinated Movement », <em>Advances in Neural Information Processing Systems</em> 15, 2003, pp. 27‑34.)). We should identify parameters that are most relevant for task success and safety, and only correct these parameters while being tolerant of variability in the other parameters. Let’s say we find out that in landings, knees caving in puts the learner at a high risk of injury ((Note: it seems obvious that knees caving in are bad. But maybe it’s a valid pattern in specific situations, with certain body types, or with elite practitioners.. At the same time, it’s not evident that instructions are the best intervention. Maybe a CLA approach, or strength and flexibility training would fit better. Therefore we shouldn’t be too quick to overcorrect.)): this is a parameter that we need to keep in check. But on the other side it doesn’t matter if your learner bends his knees at 33° or 95° when landing: it only matters that he dissipates forces safely. Focusing him on the reduction of his landing sound, or having him land barefoot would be two useful methods for this. Which bring us into the territory of external focus of attention and the constraints-led approach. Instead of focusing on the body and specific patterns of movement, we should be focused on the tangible effects of our actions. This should allow for more self-organisation and variability in movement, while keeping the outcome stable. Instead of prescribing patterns of movement, we should design learning situations that can be actively explored, with constraints that guide learners towards the most efficient solutions. We can also try to induce perturbations by changing these constraints, in order to force learners to explore different solutions than those they’re getting (too) comfortable with. We should probably also avoid repetitive drills in simplified contexts, and allow for more practise in complex and changing situations. This can be achieved by using realistic environments, tasks with opponents or partners, learning different skills together rather than in isolation, or adding some randomness (like the differential learning approach, see above).</p>\n<h2 id=\"conclusion\" tabindex=\"-1\"><strong>Conclusion</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/why-we-need-variability-of-movement/\">#</a></h2>\n<p>In this article, we have shown that variability of movement is omnipresent. It is also necessary for the flexibility and adaptation of movement: it allows for consistent outcomes in variable environments. It also seems to play a role in learning. All of this suggests we should be tolerant of variability, abandon repetitive drills and the imitation of ideal patterns of movement, and not mistake the means (technique) for the end (functional outcomes).</p>\n<p>There seems to be some exceptions though. What about disciplines and activities which are not directed to outcomes in the environment, but rather focus on the body ? Or to put it differently, where the goal of the movement is the movement itself ? Surely, in dance or gymnastics, we want to rehearse the movements so they look a specific way, so variability of the pattern of movements does not seem to be desirable. This, we will leave for another article. But I’ll end with a question. Think of activities where the movement outcome is important, like football, parkour or athletics, or even everyday life. Are there situations were we, as practitioners, coaches or spectators, focus on the pattern of movements rather than the outcome ? And if so, why ?</p>\n",
			"date_published": "2019-10-30T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/",
			"url": "https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/",
			"title": "Self-organisation and attractors",
			"content_html": "<p>In this article, we will be focusing on two key concepts of ecological-dynamics: self-organisation, and the attractor landscape.</p>\n<p>As we have <a href=\"https://senestres.github.io/adaptive-movement/the-dynamical-systems-approach\">shown previously</a>, ecological-dynamics understands our bodies as complex systems with numerous interacting parts (or degrees of freedom). Self-organisation means that the parts of the system have a tendency to adjust and adapt to each other((Davids K., Button Chris et Bennett Simon, <em>Dynamics of skill acquisition: a constraints-led approach</em>, Champaign, IL, Human Kinetics, 2008.)), creating patterns without the need for a hierarchical system of control, like the brain controlling every single part of our body. Order therefore is emergent, and does not require the micromanagement of all degrees of freedom.</p>\n<p>Because of these spontaneous tendencies and patterns, our behavior will be “attracted” to certain forms of organisation, which we will therefore call <em>attractors</em>. The best way to understand it is to imagine a ball rolling on a landscape: if it starts on a slope, it will be unstable, and will roll down until it finds a stable place at the bottom of a valley((For a really intuitive introduction to attractor landscapes, please see <a href=\"https://ncase.me/attractors/\">https://ncase.me/attractors/</a>)). If we model our behaviour this way, we end up with a landscape of attractors, the most stable behaviours being at the bottom of the valleys, and the less stable at the top of the hills. We will first examine how attractor landscapes are used to create models of behaviour, without going into the mathematical details. Then we will show how a more metaphorical use of attractors fits coaching and teaching practical purposes.</p>\n<h2 id=\"finger-wiggling-as-a-case-of-self-organization\" tabindex=\"-1\"><strong>Finger wiggling as a case of self-organization</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/\">#</a></h2>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/images/Stable-patterns-of-spontaneous-bimanual-coordination-The-in-phase-pattern-consists-in.png\" alt=\"\"></p>\n<p><a href=\"https://www.researchgate.net/figure/Stable-patterns-of-spontaneous-bimanual-coordination-The-in-phase-pattern-consists-in_fig1_263528890\">Bimanual coordination</a></p>\n<p>Let’s begin with the classic example studied by Kelso et al. ((Kelso J. A., Holt K. G., Rubin P. <em>et al.</em>, « Patterns of human interlimb coordination emerge from the properties of non-linear, limit cycle oscillatory processes: theory and data », <em>Journal of Motor Behavior</em> 13 (4), 1981, pp. 226‑261.)) Try wiggling your index fingers from left to right. You should see some patterns appearing, rather than your fingers moving independently from each other. The fingers probably make a simultaneous and identical movement (they move “in-phase”), or a simultaneous but opposed movement (“anti-phase”). These are what we call motor synergies: coordinated and invariant relationships between different parts of our bodies, based on co-variation. When I slow down my movement, both fingers slow down, they act as a single unit, maintaining this relationship. So we have an intention of movement, in this example wiggling our fingers, and then some kind of self-organisation of movement happens. The components of our bodies have self-organizing tendencies, which means we don’t need to micromanage everything, we don’t need to control every tiny degree of freedom.</p>\n<p>This should help to understand that there are <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">constraints</a> on coordination, which make certain patterns of movement more available, probable or stable than others. In this case the contstraints are neuro-anatomical, because of the way our hand muscles and our nervous system are organized. In other words, the constraints shape which behaviours are (un)stable. The stable and functional patterns of organisation are called “attractors”, and they appear as being preferential, spontaneous, easier to control or in other words: “natural”. The unstable patterns are called “repellers”. In the Kelso et al. study, there were two attractors: in-phase and anti-phase. The degrees of liberty are reduced, the fingers don’t move independently, but are coordinated and have an invariant relationship.</p>\n<p>We now have the elements to build our attractor landscape: there are two valleys, one for anti-phase, and one for in-phase. Our coordination ball will roll to the bottom of one of them. Between them are the repeller mountains formed by the less stable patterns.</p>\n<p>Let’s add a layer to our finger wiggling example. If I start in phase, and then speed up my movements, I’ll stay in phase. It is the most stable coordination pattern, probably because homologous muscles are activated at the same time, facilitating control. But if I begin moving in anti-phase, and I speed up, at some point the movement becomes difficult to control and will brutally and involuntarily change to in-phase. This change from one attractor to the next is called a phase “shift” or transition. The fact that non-homologous muscles (adductors of the left hand and abductors of the right hand) have to contract at the same time renders control more difficult, and make the anti-phase pattern less stable. The increase in speed forces the organism to transition from one pattern to the other to solve the instability. A constraint change can lead to changes in the organisation in movement: when the constraint of speed is added, the pattern goes from anti-phase (1) to in-phase (2). Here, speed is what is called a control parameter: changing this parameter leads to changes in the organisation of movement.</p>\n<p><img src=\"https://lh4.googleusercontent.com/r4y8rUoogaBHE9nx_Nav6AMnYFl3CyAPmKzRP5A9qdNajzL1zY9ouHdVCVcc7MbmVnJHSuOk94iyiwbejZhWyGyTQIY_EioJZZvVHEpNe1iZ2UsdvhfqCYsy9E3XBq4w-Z_QltHy\" alt=\"\"></p>\n<p>An attractor landscape</p>\n<p>In motor control research, these concepts are used to mathematically model our behaviour. They are a way of representing, not explaining what happens. We don’t have little attractors hidden somewhere, who decide what we do. But when we observe our behaviour, it does seem as if it was attracted in certain directions. On this blog, we will use the concept of attractors in this metaphoric and phenomenological way, rather than going into the mathematical details. It is a very useful concept for coaches and teachers, while only researchers will really benefit from all the complex mathematics behind it.</p>\n<h2 id=\"can-we-apply-this-to-more-complex-movements\" tabindex=\"-1\"><strong>Can we apply this to more complex movements ?</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/\">#</a></h2>\n<p>Let’s examine a real-world movement example, and see how we can use attractors metaphorically. Take the example of snowboard, which would also work with wakeboard, skateboard, etc. I ride goofy, with my right foot in front. From the start, it just felt more natural and comfortable that way. It was the most “attractive” solution, so let’s call that an “attractor”. And it just didn’t feel natural to ride regular (left foot in front), let’s call that a “repeller”. To visualize this, let’s imagine my coordination pattern is a ball rolling on a surface. The attractor (goofy) is a valley; the repeller (regular) is a mountain. This is an attractor landscape. The ball tends to roll from the mountain to the valley, the same way I’m attracted to one coordination pattern rather than the other.</p>\n<p>Attractors are not established once and for all: they change when the internal and/or external constraints change. With practice, I became even more confident in the goofy position: the attractor is even deeper, and maybe wider than before. By contrast, it still feels weird, and even scary, to switch (put my left foot in front). Sure, I’m getting used to it. But as soon as I’m going fast, or if the slope steepens, or when I’m tired or scared, I revert to goofy. Maybe it’s even less stable because I became so confident on (I’m so attracted to) my normal side ((We have to note here that there might be some transfer from one side to the other: training on my good side probably helped me improve on my bad side too. But still, I don’t feel comfortable enough.)). It takes conscious effort to ride switch, constant attention to maintain it. And it feels like I’m fighting against my spontaneous tendencies, and that riding normally is just more functional and efficient, so why even bother ?</p>\n<p>One important thing to note here, is that I can either ride normal, or switch; anything in between will be even less stable. The implication is that there will be non-linear changes in coordination. When I ride switch, a slight change in the environment might have a drastic effect on my movements, forcing me to suddenly shift from switch to normal, without going through all the intermediary solutions.</p>\n<p>This effect of the environment, making certain behaviours more inviting than others, should make us think back to the concept of <a href=\"https://senestres.github.io/adaptive-movement/affordances-perception-and-action\">affordances</a>. The environment offers and suggests certain action possibilities, like the handle of a coffee mug invites our grasp, especially if we had the intention of picking it up. We should therefore expect to see an attractor when an environment affords this specific behaviour, a repeller when it doesn’t. If the mug is boiling hot and the handle is visible, grasping the handle is attractive, but holding the mug directly in our palms, not so much.</p>\n<h2 id=\"attractors-an-essential-conceptual-tool-for-coaches\" tabindex=\"-1\"><strong>Attractors: an essential conceptual tool for coaches</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/\">#</a></h2>\n<p>I think this is useful for coaches in different ways. First, it helps understanding that learners have spontaneous tendencies, a pre-existing attractor landscape which depends on their past experiences and individual constraints. It seems to be a bit more explanatory than assuming that the spontaneous tendencies of learners all come from pre-existing knowledge. I only feel comfortable facing one way on a skateboard, but I don’t think it’s because there’s some knowledge I’m missing. As coaches, we need to take into account these spontaneous tendencies, maybe find out where they come from, and ask ourselves: is this something we want to fight against, or should we use them to our advantage ? In other words, are the skills we are training competing or cooperating with the spontaneous tendencies((Zanone P. G. et Kelso J. A., « Evolution of behavioral attractors with learning: nonequilibrium phase transitions », <em>Journal of Experimental Psychology. Human Perception and Performance</em> 18 (2), 1992, pp. 403‑421.)) ?</p>\n<p>Maybe the novice patterns we see are inefficient, dangerous, or simply we would like our learners to have a broader movement repertoire. Then we want to find ways to go against the learners pre-existing attractors. This seems to mean two things: we can make these novice patterns less attractive, and/or we can make the expert behaviours more attractive. And then the question becomes: to achieve this, what parameters or constraints can we change ? On my snowboard, it seems like if I’m going slow enough, or if I’m on a gentle slope, riding switch becomes a lot more attractive. We could also imagine temporarily changing the configuration of my bindings to make it less attractive to ride normally. In more general terms, this should invite teachers to think more carefully about the ways they design or choose their learning environments, in ways that create the right attractors and affordances. You want to see a specific behavior ? Design a learning situation that invites and makes this behaviour attractive.</p>\n<p>Of course, the fact that there is some self-organization happening does not mean that we don’t have any choice in the way we move, or that our intentions or the instructions of a teacher have no effect. In a case where there are two or more attractors, the way we focus might help us shift from one pattern of movement to the next. In the same way, instructions can be thought of as (soft) constraints that can make inefficient patterns less attractive, or help us maintain unstable coordination patterns. There is the way you walk while going down the street thinking of your next meal, and there is the way you walk while doing your best to reenact the Monty Python’s silly walks.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\"><strong>Conclusion</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/self-organisation-and-attractors/\">#</a></h2>\n<p>Let’s sum up. We’ve seen that coordination and motor behaviour are, at least in part, self-organized. Because of different internal and external constraints, certain kinds of movements will be more attractive (stable, easy to control, natural, etc.) and some will be less so. The landscape of attractors metaphor is probably the best conceptual tool we have to make sense of these phenomena. It should give teachers and practitioners fresh perspectives on the way they teach and train.</p>\n",
			"date_published": "2019-10-30T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/",
			"url": "https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/",
			"title": "The dynamical systems approach",
			"content_html": "<p>Dynamical systems theory is a branch of mathematics used to describe complex dynamical systems. These are systems with multiple parts that interact with each other and change over time. Examples can range from living things like a colony of ants to inorganic systems like Earth’s climate. <a href=\"https://senestres.github.io/adaptive-movement/introduction-to-ecological-dynamics\">Ecological-dynamics</a> adds these mathematical insights to <a href=\"https://senestres.github.io/adaptive-movement/affordances-perception-and-action\">ecological psychology</a> in order to understand how we control our movements, focusing on the interactions between the body and environment instead of reducing it to a top-down control from our brain. In this article, we will try to understand our bodies as complex dynamical systems, while not going into the details of the complex equations.</p>\n<h1 id=\"the-bernstein-problems\" tabindex=\"-1\">The Bernstein problems <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/\">#</a></h1>\n<p>Traditional theories of motor control explain the control of movement by focusing on the processing and storing of information. They postulate a hierarchical control, in which we direct actions using programs, schemas, representations or knowledge. These theories can be called “prescriptive” (“written in advance”), because the general idea is that the brain prepares an action plan, which will then be applied by the muscles to produce movement.</p>\n<p>Nikolai Bernstein, a soviet neurophysiologist, thought this seemed not very probable. He thought that because of the complexity of the motor system, a 1:1 relationship between a neural signal and a motor output would be impossible((Bernstein N, <em>The co-ordination and regulation of movements</em>, Oxford, Pergamon Press, 1967.)) ((Chow Jia Yi, Davids K., Button Chris <em>et al.</em>, <em>Nonlinear pedagogy in skill acquisition: an introduction</em>, London ; New York, NY, Routledge, 2016.)). On the contrary, identical neural commands would have variable effects in terms of movement. A first source for this variability would be the obvious neurophysiological one: neural transmission is neither passive (neurons interact) nor perfect (there is always noise in the signal)((Turvey Michael T., Fitch Hollis L. et Tuller Betty, « The Bernstein Perspective: I. The Problems of Degrees of Freedom and Context-Conditioned Variability », in: Kelso J. A. Scott (éd.), <em>Human motor behavior: an introduction</em>, Hillsdale, N.J, L. Erlbaum, 1982, pp. 239‑252.)). A second source comes from our anatomy: the contraction of a muscle produces different actions depending on the context. For example, the pectoralis major can be an adductor or abductor of the arm, depending on the starting position of the arm((Turvey Michael T., Fitch Hollis L. et Tuller Betty, « The Bernstein Perspective: I. The Problems of Degrees of Freedom and Context-Conditioned Variability », in: Kelso J. A. Scott (éd.), <em>Human motor behavior: an introduction</em>, Hillsdale, N.J, L. Erlbaum, 1982, pp. 239‑252.)). In addition, this problem becomes larger when we consider biomechanics: a same muscle contraction can produce a tiny movement when it is opposed to gravity or a big one if we are using inertia from a previous movement ((Turvey Michael T., Fitch Hollis L. et Tuller Betty, « The Bernstein Perspective: I. The Problems of Degrees of Freedom and Context-Conditioned Variability », in: Kelso J. A. Scott (éd.), <em>Human motor behavior: an introduction</em>, Hillsdale, N.J, L. Erlbaum, 1982, pp. 239‑252.)) .</p>\n<p>Bernstein found there was another problem for prescriptive theories, which he called the degrees of freedom problem((Bernstein N, <em>The co-ordination and regulation of movements</em>, Oxford, Pergamon Press, 1967.)). Our bodies are made up of more elements than necessary to solve our daily tasks. How then do we choose which elements we use to solve a given task? Bernstein thought this was problematic, because the number of degrees of freedom (the number of parameters than can vary independently) of our bodies is for all practical purposes infinite. We can activate independently and in various ways our hundreds of muscles and articulations. Even a very simple task, like moving the arm towards an object, can be thought of needing the control of over 2600 degrees of liberty((Turvey Michael T., Fitch Hollis L. et Tuller Betty, « The Bernstein Perspective: I. The Problems of Degrees of Freedom and Context-Conditioned Variability », in: Kelso J. A. Scott (éd.), <em>Human motor behavior: an introduction</em>, Hillsdale, N.J, L. Erlbaum, 1982, pp. 239‑252.)). How do we select a specific way of realising an action, from the multitude of other possibilities? Is the brain powerful enough to act as a central control unit?</p>\n<p>As a first step to solve his problems, Bernstein proposed that degrees of freedom have to be constrained and reduced in some way((Bernstein N, <em>The co-ordination and regulation of movements</em>, Oxford, Pergamon Press, 1967.)). He thought that the first stage of learning of any motor skill would be a “freezing” of degrees of freedom. Certain articulations would become rigid, which would reduce the number of independent elements to control. For example, a novice would throw a ball using only his elbow, the rest of his body not really participating in the movement. Beginners therefore would look quite tense and their movements would lack flexibility. But with experience, certain degrees of liberty would be “freed”, in order to obtain more efficient and adaptable movement. Practitioners would start putting their whole body in their throw, using their shoulder, rotating their hips and then even taking a few steps to create momentum.</p>\n<h1 id=\"complex-systems-and-emergence\" tabindex=\"-1\">Complex systems and emergence <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/\">#</a></h1>\n<p>These insights have given rise to theories that understand our bodies as complex dynamical systems. By complex, we mean that our bodies are systems made up of multiple independent elements (the degrees of liberty we talked about earlier) that interact with each other. The organisation of movement emerges from the interaction between different parts of the system, rather than being planified entirely by the brain. We can think of this as a bottom-up model, rather than a top-down one.</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/images/snowflake.jpg\" alt=\"\"></p>\n<p>The complex structure of a snowflake</p>\n<p>This might be a bit counterintuitive at first, because we’re used to thinking that the brain is in charge. It might help to realize that this kind of emergence of order in complex systems is really a common thing in nature. Take snowflakes for example: they come in varied shapes, but have highly structured and often symmetrical features. There is no snowflake designer out there, though. But because of the physical properties of water, they crystalize with specific structures. The crystallizing snowflakes fall and interact with the atmosphere, producing unique results depending on the humidity and temperature. Let’s take another example: insects like ants or termites. How do they coordinate to build complex structures? There is no architect ant to supervise and give plans to the others ants. They each react to chemical trails left by others, and the sum of these interactions can create complex and organised structures. Any kind of flock or swarm of animals seem to operate in this way. This should help us understand that movement can be organised without the need for a central unit of control doing all the job. Movement “can be regular, without being regulated”((Gibson James J., <em>The ecological approach to visual perception</em>, Boston, Houghton Mifflin, 1979, p. 225.)).</p>\n<p>Movement is regular because it is guided by <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">constraints</a>. A constraint can be thought of as anything that eliminates a possibility of movement. The constraints can come from the individual (genes, length of legs, motivation…), the environment (gravity, surfaces…) or the task (rules, goals, objectives…)((Newell K. M., « Constraints on the Development of Coordination », in: Wade M. G. et Whiting H. T. A. (éds), <em>Motor Development in Children: Aspects of Coordination and Control</em>, Dordrecht, Springer Netherlands, 1986, pp. 341‑360.)). This helps to give an answer to the degrees of freedom (DoF) problem: controlling and regulating the DoF is not that much work, because most work is done by the interaction between the constraints of the system. Constraints guide and canalise movement in certain directions, remove superfluous and potentially inefficient solutions. The number of DoF is reduced, and movement becomes easier to control. Constraints render certain possibilities of action difficult or impossible, and prevent movement developing in all directions. This does not mean that movement always has to be strictly constrained: some <a href=\"https://senestres.github.io/adaptive-movement/why-we-need-variability-of-movement\">variability can be positive</a> and necessary for being adaptative, but we’ll leave this aside for the moment.</p>\n<h1 id=\"actions-as-temporary-motor-coordinations\" tabindex=\"-1\">Actions as temporary motor coordinations <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/\">#</a></h1>\n<p>Let’s take a famous example((Kelso Scott, L. Southard Dan et Goodman Dekailah, « On the coordination of two-handed movements », <em>Journal of experimental psychology. Human perception and performance</em> 5, 1979, pp. 229‑38.)) to make these ideas a bit less abstract. Try doing this: wiggle your index fingers from left to right. You should find that it’s very hard to do random movements. Rather, your fingers will spontaneously coordinate, moving simultaneously in identical or opposed movements like windshield wipers. There are constraints on coordination, making it is easier to control movement when you can activate the same muscles at the same time. Movement emerges from the interaction of these constraints. In this perspective, actions are not planned, they are temporary motor coordinations.</p>\n<p>We can see that coordination is emergent in more complex cases too. Let’s take the discussion of locomotion by Thelen et al.((Thelen Esther, Fisher Donna M. et Ridley-Johnson Robyn, « The relationship between physical growth and a newborn reflex », <em>Infant Behavior and Development</em> 7 (4), 1984, pp. 479‑493.)) When held, newborn children can coordinate their legs in a way that looks a lot like walking. After a few months, this behaviour disappears. A traditional account of this phenomenon would focus on the nervous system, or the brain specifically. We could suppose that this is some kind of primitive reflex which quickly disappears, and that children have to regain this capacity by learning and practice, in order to be really able to walk. In fact, a better explanation takes into account the bodily constraints. Children gain a lot of weight during the first few months, at a faster rate than they gain strength. Because walking necessitates lifting their legs up, at some point it becomes impossible (or at least, less attractive) just because of the weight of the legs. Thelen et al. have shown that adding a bit of weight to the legs would suppress the behavior; and that submerging the kids in water would restore it. Here, the constraints don’t come only from our bodies: environmental constraints affect our behaviour too. This is not to mean that the nervous system and the brain never do anything, but at the very least we can see how behaviour emerges from the interaction of different constraints.</p>\n<p>One consequence of this perspective, is that because different coordinations emerge depending on the constraints of the situation, our behaviour will be <a href=\"https://senestres.github.io/adaptive-movement/self-organisation-and-attractors\">“attracted”</a> in specific directions. Some forms of movement are spontaneous, come easier or feel more natural.</p>\n<h1 id=\"a-few-concluding-thoughts\" tabindex=\"-1\">A few concluding thoughts <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-dynamical-systems-approach/\">#</a></h1>\n<p>In this article, we’ve shown how we can understand the organisation of movement as emerging from the interaction of the different independent elements of our bodies as well as our environments, rather than simply arising from a top-down control by the brain. It would be a nightmare if everything had to be tightly coordinated by the brain.</p>\n<p>Rather than focusing on knowledge stored in the brain, this helps us to take into account different constraints. The weather, the surfaces, the apparatuses, the length of our legs, all of these have an incidence on the patterns of movement we will see emerge. By changing some of these elements, we can constrain and guide movement in desired directions, which forms the basis of the <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">constraint-led approach</a>.</p>\n<p>It also allows for the integration of approaches or domains that are usually separated, like strength training and learning. Think of the times where you seem to have “lost” a skill. Did you forget ? Or have some other constraints changed ? Maybe you’ve lost strength, flexibility,  or you’re training in a new environment. This constraints-based account might be a good explanation of why we’re able to regain skills faster that it took to acquire them the first time.</p>\n",
			"date_published": "2019-10-29T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/",
			"url": "https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/",
			"title": "The floor is lava",
			"content_html": "<p>You probably know the game called “the floor is lava”, where players must traverse space without touching the ground. Although it is a kids’ game, it is also popular among parkour practitioners, who use different obstacles, ledges, walls or rails to avoid touching the “lava”. Here, I will argue that this game is a great example of a “naive” version of the <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">constraints-led approach</a>. Different versions of the game might exist, so we will start discussing an unstructured case and then examine how different variations can be used to achieve learning goals.</p>\n<h1 id=\"a-non-prescriptive-game\" tabindex=\"-1\">A non-prescriptive game <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/\">#</a></h1>\n<p>If we observe a few kids playing the floor is lava, it might at first seem like a case of unguided exploration. They jump, climb, crawl, run or vault everywhere. There doesn’t seem to be a right or wrong solution, no particular technique is rehearsed, and different paths can be taken. But there is at least one rule: whatever they do, they can’t touch the ground. And usually, there is an objective, like trying to get from one point of the environment to another. So although the game is not very prescriptive (there’s not a lot of precise instructions), it is still goal-oriented and we would be mistaken to describe it as a case of totally unguided exploration.</p>\n<p>The game is better thought of as a kind of problem-solving task: I know what to do, but I have to find out how to do it. It fosters exploration, trial and error, adaptability. We can even go as far as to say that it would require creativity: when I’m stuck somewhere, I’m forced to think out of the box in order to keep going. At the very least, I’ll need to observe the environment attentively, and find new <a href=\"https://senestres.github.io/adaptive-movement/affordances-perception-and-action\">affordances</a>: is it possible to jump there ? can I find an asperity in the wall that my fingers can get a hold of ? or maybe there is a ledge I can use to hang from ?</p>\n<h1 id=\"a-game-structured-by-constraints\" tabindex=\"-1\">A game structured by constraints <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/\">#</a></h1>\n<p>With the <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">CLA</a>, we can understand how different constraints structure this process of exploration, and canalize the resulting movement solutions.</p>\n<p>The task constraints are the rules and objectives of the game. Kids will usually self-regulate: they decide where to start and where to stop, what are the rules, what counts as “the ground”, etc. They don’t necessarily discuss and negotiate all the details. So although the general frame might be set to be the same for every player (this is where we start, this is where we want to go, and this is the lava we don’t want to touch), there might be a lot left open to interpretation. This leaves some space for the individualisation of the challenge. Some might use all means necessary, but often players will set additional task constraints for themselves, like avoiding an obvious foothold, or restricting the use of hands for balance or momentum for a jump. Players of different skill levels can therefore attempt the “same” challenge, while still facing a challenge of the appropriate level. What happens quite often is that once they’ve accomplished the challenge in “easy mode”, players will try again with added constraints (“let’s try it without using this wall”, etc.).</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/images/sautdebras.png\" alt=\"\"></p>\n<p>Better not fall in that lava...</p>\n<p>The environmental constraints will depend on where they’re playing: indoors, on a playground, in the streets, on trees… They depend on the context too: are they playing alone or with friends ? Is the ground dry or is it raining ? Are they playing at night or is there enough light ? These constraints will afford some movement solutions, like balancing on a rail to cross a gap. On the flip side, they remove some movement solutions: walking through a wall is impossible, and jumping over it without momentum is too risky, etc.</p>\n<p>We should always think of the environmental constraints together with the individual constraints. The individual constraints will also ensure that some actions are possible or impossible, easy or hard, attractive or not. For example, a tall or flexible practitioner might be able to reach a certain ledge that others cannot, and a not-so-confident player might prefer progressing slowly and avoiding paths that require jumping. Because the game does not prescribe the movement solutions that need to be used, it leaves space for individual solutions, tailored to everyone’s individual constraints. There is no “one size fits all” solution, what is efficient for me might not be the best solution for you.</p>\n<h1 id=\"using-constraints-for-learning\" tabindex=\"-1\">Using constraints for learning <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/\">#</a></h1>\n<p>Now we’ve seen why “the floor is lava” works so well in unregulated situations, and that we’ve shown how we can see it as a constraints-based game, there’s still a few elements to discuss. After all, the <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">constraints-led approach</a> does not consist in adding random constraints to any kind of teaching situation. What we want is to use constraints in a systematic way to achieve learning goals. The floor is lava is a fun game that can be used as such, but a teacher can also use it with the intention of improving specific skills.</p>\n<p>The first thing you would want to do is choose a situation that provides the right affordances and opportunities for action. You want your learners to improve their jumps ? Choose a course that requires them to jump. You want them to improve their vaults ? Pick a setting with a lot of walls to vault over. Usually you will not need to tell them what to practice, because they need to use those techniques to get to point B. Sometimes they will surprise you, coming up with solutions you didn’t expect them to use. That’s pretty cool, it means they are smart and are using all the opportunities that their bodies and the environment provide. As we have shown, the floor is lava is a great game to develop higher order skills like creativity and adaptation. And because it can be played in complex and realistic environments, the players learn to interact with and move efficiently through these spaces, which is a useful life skill.</p>\n<p>But if you really want them to train specific techniques, you can always add constraints to guide them to these solutions. Here are some ideas:</p>\n<ul>\n<li>Add an imposed point of passage, a chokepoint.</li>\n<li>The challenge has to be done multiple times, but each path can be used only once.</li>\n<li>Add a few techniques (one jump, a kong, etc.) that need to be used during the challenge, but they can choose where they use them.</li>\n<li>Restrict the number of steps or jumps they can use.</li>\n<li>Restrict the use of a hand or a foot</li>\n</ul>\n<p>And of course, you can always alternate a floor is lava situation with a bit of more traditional teaching, were you focus their attention on a specific technique they might not be aware of, and then get them to try that on the lava challenge. It might be especially useful with beginners, who otherwise could feel lost without any guidance or repertoire of techniques.</p>\n<p>If you’re not sure if all players will be able to achieve the challenge, there are a few things you can do. One of them is to allow collaboration, where players can help each other in the most difficult parts. Another would be to organise it like a video game: all players have x number of lives. If they put a foot in the lava, they lose a life. The goal is to get to point B without losing any lives, but if there is a really difficult passage they can always put one foot down to skip it, which allows a more flexible challenge. On the contrary, if you have high skilled practitioners you can always add constraints like not using the left hand, or transporting an object.</p>\n<h1 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/the-floor-is-lava/\">#</a></h1>\n<p>In this article I’ve used “the floor is lava” as an example of a constraint-based game. Considering how this game is both fun and challenging, while providing learning opportunities, we should learn from it to structure the way we teach. We should take away that although we usually should tell our learners <em>what</em> to do, we don’t need to tell them <em>how</em> to do it. We should not focus too much on instructions and feedback, but think of all the constraints that we can use to guide our learners towards skillful behavior. And we should design our learning situations to provide enough autonomy and allow the emergence of individualized and/or creative solutions.</p>\n",
			"date_published": "2019-08-13T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/",
			"url": "https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/",
			"title": "Introduction to Ecological Dynamics",
			"content_html": "<p>Ecological Dynamics is a scientific framework that studies the behaviour neurobiological systems. This involves how living organisms form processes of action, perception and cognition. It is a very holistic approach to studying behaviour, as it considers both the living organism, as well as the environment that it relies and acts upon.</p>\n<p>Ecological Dynamics (ED) is a framework that finds its roots in two other fields of science: The psychological school of thought called Ecological Psychology and the mathematical approach called Dynamical Systems Theory. Having a brief understanding of both theories is necessary to understand why they compliment each other so well, and ultimately it allows us to understand what Ecological Dynamics is and why it is relevant in sports coaching, including Parkour.</p>\n<h2 id=\"ecological-psychology\" tabindex=\"-1\"><strong>Ecological Psychology</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>Ecological Psychology is a psychological approach that was developed mid 20th century by James Gibson. He argued that in order to understand and study behaviour and cognition, we need to pay close attention to the context in which the person is found. Behaviour and cognition are a result of a continuous interaction between the organism and the environment, which makes it impossible to see the two separately. (( Gibson James J., <em>The ecological approach to visual perception</em>, Boston, Houghton Mifflin, 1979, p. 127) )) Imagine, for example, walking into a social networking event. If you happen to be particularly hungry at that moment in time, you might find yourself looking for any available snacks. If you find them, however, you wouldn’t finish a whole bowl of peanuts like you would if you were at home. If you have particular networking goals that day, on the other hand, you would quickly assess other people attending the event, but your approach towards them would be different than talking to new people in a less formal setting.</p>\n<h2 id=\"perception-and-action\" tabindex=\"-1\"><strong>Perception and Action</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>One of the main topics within Ecological Psychology is perception and information processing. Before we can start studying what information we perceive and how we process it, we should ask ourselves: why is it that we perceive? We all know that we have our five Aristotelian senses that allow us to see, hear, feel, touch, smell and taste. Then we have lesser known senses like balance, proprioception (self awareness of posture) and pain, among others.</p>\n<p>Despite our ability to form an opinion on many of these senses, like appreciation of music or visual art, and disliking pain, bitter food or loud noises, the main point of perception is much more practical. Perception allows us to respond to what's happening around us. In other words, perception is for action. The relationship between action and perception is bilateral, however, as we also need to act in order to perceive. Our perceptive ability is enhanced by exploring the environment. We can do so through touch, which can give us information about the texture or weight of objects. Another way to explore is by moving around so we can change our visual perspective on our surroundings, which helps us determine how visual size of objects change, or how objects move relative to each other. This can be seen especially clearly in birds: before they fly off, they often turn their heads left and right, which makes the difference in visual perspective between their two eyes more clear, which in turn can be used as spatial information.</p>\n<h2 id=\"direct-perception\" tabindex=\"-1\"><strong>Direct Perception</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>A key concept in Ecological Psychology is the idea of 'Direct Perception'. Gibson stated that the information that we perceive is sufficient for us work with and act upon. The ambient array of our vision gives us enough information to act on our environment. By calibrating our perception we can learn to recognise how far we can reach or how big of a doorframe we can walk through. For example, in a study conducted by Wraga, it was found that maximum stepping height is perceived as a certain portion of eye-height, which is calibrated to an individual’s specific ability like flexibility and strength. The eye-height, in this case, is a directly perceived informational variable that allows us to perceive a possibility for action. (( Wraga, M. (1999). The role of eye height in perceiving affordances and object dimensions. <em>Perception &amp; Psychophysics</em>, <em>61</em>(3), 490–507.))</p>\n<h2 id=\"affordances\" tabindex=\"-1\"><strong>Affordances</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>The possibilities for action that we perceive are called 'affordances'. Affordances can be seen as the possibilities for action that the environment give a certain individual. They are a combination of objective features of the environment and abilities of an individual. Features of the environment are called constraints (or ‘environmental constraints’), and are variables like surface type, size, weight and shape of objects. Abilities of an individual are called effectivities (or ‘personal constraints’). Effectivities are an individual's body and limb length, strength, energy levels and technical experience performing certain tasks. As you can imagine, affordances change continuously over time, depending on weather conditions, repositioning of objects and changes in strength levels and technical experience. Quite literally, through training, our relationship with our environment changes.</p>\n<h2 id=\"dynamical-systems-theory\" tabindex=\"-1\">Dynamical Systems Theory <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>This is where the second part of Ecological Dynamics comes in: Dynamical Systems Theory. This theory explains the behaviour of complex dynamical systems where a systems functioning relies on the behaviour of smaller elements. When the behaviour of one element changes, the whole system shifts accordingly. The interesting thing about Dynamical Systems is that there is no overruling mechanism that decides how the system develops over time. The end result of how the system behaves happens through self-organisation of the elements. A good example of self-organisation in physics is how freezing water can form the shape of a snowflake, with its characteristic fractalised structure. The same can be found in human movement, where we develop similar movement patterns over time like alternating leg movement to walk, or alternating arm and leg movement to crawl. A lot of these movements can be found in babies in the form of reflexes.</p>\n<p>The link between the two fields of science is not hard to see. Ecological Psychology thinks in systems and interactions between living organism and their environments. Ecological Dynamics takes elements from Dynamical Systems theory and applies it to Ecological Psychology in order to make predictive models of human behaviour, perception and cognition.</p>\n<h2 id=\"ecological-dynamics-and-coaching-the-constraints-led-approach\" tabindex=\"-1\"><strong>Ecological Dynamics and Coaching: the Constraints led Approach</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>The realisation that humans function within the context of the environment, rather than independently as a fully autonomous system has great implications on how we understand the functioning of the human body. On top of this, it also radically changes how we should look at cognitive learning and physical skill acquisition. The absolute majority of sports, from team sports like football and tennis to parkour and mountain biking, rely heavily on interaction with a dynamical environment. In some cases the environment is very responsive to interaction, like other people or a ball that’s flying around, and in other situations the environment is relatively stable. In either situation, the context is defining for the possibilities in training. Acknowledging how important these elements are to practice, a training method called the <a href=\"https://senestres.github.io/adaptive-movement/brief-introduction-to-the-constraints-led-approach\">‘Constraints-Led Approach’ (CLA)</a> was developed. The purpose of this blog is to provide a central place for coaches and practitioners to understand and learn how to apply the CLA. We also provide background information like this article about theories like Ecological Dynamics and how they form the basis of the CLA. (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. ))</p>\n<h2 id=\"parkour-and-ecological-dynamics\" tabindex=\"-1\"><strong>Parkour and Ecological Dynamics</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/introduction-to-ecological-dynamics/\">#</a></h2>\n<p>What brings three Parkour coaches to find so much interest in Ecological Dynamics? Perhaps you already found some links between the brief introduction to the Ecological Dynamics framework and Parkour.</p>\n<p>In Parkour, we heavily rely on our local environment for training, be it urban or natural. Our training is shaped by the places we live in, and it’s not uncommon to find people from different cities to have different ways of moving. You may even have heard a lot of practitioners say something like ‘Parkour has changed the way I see the city.’ Often times they refer to how they feel more freedom and possibilities in the city, as opposed to viewing common obstacles like walls and rails like limitation. Which in fact, is what they are, as they are meant to steer us to get from one place to another via certain routes. Does Parkour really change the way we see our surroundings? Well, maybe we are actually on to something here. By teaching ourselves various new abilities and exploring new ways to interact with our environment we don’t just become better at a hobby we can turn on and off. Understanding that perception of for action, we can realise that through all this practice we automatically will see new possibilities in our environment. Which, in an urban environment that is meant to make us move in certain places, can be an experience that creates a greater sense of freedom.</p>\n",
			"date_published": "2019-08-13T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/",
			"url": "https://senestres.github.io/adaptive-movement/blog/",
			"title": "Blog",
			"content_html": "",
			"date_published": "2019-08-12T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/",
			"url": "https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/",
			"title": "Introduction to the constraints-led approach",
			"content_html": "<p>The constraints-led approach (CLA) is a framework for teaching, coaching and practicing motor skills. It takes a holistic and individual approach to learning by considering the interactions between different ‘constraints’: the performer, the environment and the task. The CLA advocates a hands-off -approach, where the coach designs the environment and directs learning by manipulating the constraints, rather than using prescriptive instructions and corrective feedback. The learner is challenged to find his own functional movement solutions through variable practice and trial and error (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )) (( Chow, J. Y., Davids, K., Button, C., Rein, R., Hristovski, R., &amp; Koh, M. (2009). Dynamics of multi-articular coordination in neurobiological systems. Nonlinear Dynamics Psychology and Life Sciences, 13(1), 27-52. )) (( Gibson, J. J. (2014). The ecological approach to visual perception: classic edition. Psychology Press. p.213 )). The CLA is not a magic bullet for all learning situations, but according to preliminary evidence (( Gray, R. (2018). Comparing cueing and constraints interventions for increasing launch angle in baseball batting. Sport, Exercise, and Performance Psychology, 7(3), 318-332. )), it is an exceptionally well suited method for efficient motor skill practice.</p>\n<p>The constraints-led approach is based on a theoretical framework called ecological-dynamics (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )) Having a solid understanding of this theoretical foundation will allow you to implement the CLA in your practice with more confidence and flexibility. Before diving into this one, I would encourage you to take a look at other articles on <a href=\"https://senestres.github.io/adaptive-movement/introduction-to-ecological-dynamics\">ecological dynamics</a>, dynamical systems theory and ecological psychology.</p>\n<p>In this summarizing article we’ll first take a brief look at three underlying concepts in the CLA: the interacting constraints, the action-perception coupling and body’s self-organization. Then we’ll look at the CLA coaching principles.</p>\n<h2 id=\"what-are-constraints\" tabindex=\"-1\"><strong>What are constraints?</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/\">#</a></h2>\n<p>Constraints are physical or abstract boundaries, within which learners can search and explore movement solutions. (( Chow, J. Y., Davids, K., Button, C., Rein, R., Hristovski, R., &amp; Koh, M. (2009). Dynamics of multi-articular coordination in neurobiological systems. Nonlinear Dynamics Psychology and Life Sciences, 13(1), 27-52. )) Constraints are classified into three categories: performer, environment and task constraints. (( Newell, K. M. (1986). Constraints on the development of coordination. Motor development in children: Aspects of coordination and control, 34, 341-360. ))</p>\n<ul>\n<li>Performer constraints are characteristics that relate to physical and functional aspects of the performer. For example height, strength, mood or motivation are performer constraints.</li>\n<li>Environmental constraints can be physical or sociocultural: gravity, weather, surface materials, obstacles, cultural norms or family support.</li>\n<li>Task constraints include rules, objectives, playing areas, number of players, equipment and information sources present. They are the most relevant when developing movement skills as they are the easiest to manipulate.</li>\n</ul>\n<p>All human movement  emerges from the interaction of constraints. Therefore all training methods involve constraints. What sets the constraints-led approach apart from other training methods, however, is the deliberate manipulation of the constraints to guide learning.</p>\n<p>For most people, the word ‘constraint’ carries a negative connotation of restricting or limiting something. In the constraints-led approach, ‘constraint’ refers to the scientific meaning of <em>information to shape or guide a system.</em> (( Renshaw, I., Davids, K., Newcombe, D., &amp; Roberts, W. (2019). The Constraints-Led Approach: Principles for Sports Coaching and Practice Design. Routledge. p. 14 )) Information, and more precisely the perception of information from the environment, is indeed at the core of constraints-led approach.</p>\n<h2 id=\"constraints-action-and-perception-movement\" tabindex=\"-1\"><strong>Constraints + action and perception = movement</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/\">#</a></h2>\n<p>Consider that you are going to a friend’s place and you see a staircase and an elevator. Depending on your current mood (performer constraint), amount of stairs (environmental constraint) and whether you are in a hurry or not (task constraint) you end up making a decision between using the elevator or the staircase to get to your friends door.</p>\n<p>Human movement therefore is always a complex interaction between the task, the environment and the performer. Our action depends on the perception of these constraints, but also our perception changes as we do actions.</p>\n<p>On your way running up the stairs (action) you might notice getting all sweaty and you see that you have still four flights of stairs to go (perception). So you might decide to call the elevator (action) after all, if you had a tiring day. If you are currently trying to improve your stamina however, you might feel happy with the exhaustion (perception) and keep walking up (action). Action and perception therefore always follow each other in cyclical nature, or as James Gibson put it:</p>\n<blockquote>\n<p><em>“We must perceive in order to move, but we must also move in order to perceive.”</em></p>\n<p>GIBSON (2014, P.213)</p>\n</blockquote>\n<p>This same chain of action and perception, or ‘action-perception coupling’, applies to all human movement from picking up a coffee cup to operating a fighter aircraft, or receiving a pass in football to approaching a wall in parkour.</p>\n<p><img src=\"https://docs.google.com/drawings/d/s8aOlzVGoyr2fCM784qIoAg/image?w=489&amp;h=237&amp;rev=1&amp;ac=1&amp;parent=1KLW09oozJVdc4Q7sJCElv5PWqgMzcm4wTYpLW40pLBw\" alt=\"\"></p>\n<p>Table 1. Adapted from Newell (1986) ((Newell, K. M. (1986). Constraints on the development of coordination. Motor development in children: Aspects of coordination and control, 34, 341-360.))</p>\n<p>When designing lessons and learning environments it is important to maintain this link between action and perception. In the constraints-led approach action and perception are always tightly coupled, as learners have to make their own solutions based on the information present. We will discuss this in more practical terms later. (( The article on <a href=\"https://senestres.github.io/adaptive-movement/introduction-to-ecological-dynamics\">ecological psychology</a> provides a more in-depth look at human interaction with the environment. ))</p>\n<h2 id=\"humans-are-complex-systems\" tabindex=\"-1\"><strong>Humans are complex systems</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/\">#</a></h2>\n<p>Another fundamental idea in constraints-led approach is that a human is considered as a complex system, that needs to organize itself in order to produce functional movements. (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )) As discussed in the article on the dynamical systems approach, complex systems are made of multiple different parts interacting with each other, like an ant colony, the climate or the human body.</p>\n<p>Consider the action of calling the elevator from the previous example. Out of all the possible directions your arm muscles and joints could take, you organize them to travel towards the call button to press it. Then consider an acrobat performing backflip on a tightwire. How does the body know what to do? (( This is the famous Degrees of Freedom problem (DOF) )) This process of producing functional movements is called self-organization.</p>\n<p>You can think a self-organization process of a child who is learning to walk. His first steps are clumsy and his legs rigid, but after a lot of practice in different places, he slowly starts to organize his legs, hips and arms more fluidly. Indeed, for the self-organization process to become fluent and natural in any skill, it requires a lot of practice with a lot of variation. If you’re interested to know why this is so, take a look at the articles on variation and dynamic systems approach.</p>\n<h2 id=\"characteristics-of-the-constraints-led-approach\" tabindex=\"-1\"><strong>Characteristics of the constraints-led approach</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/\">#</a></h2>\n<p>To understand how to use the CLA, and why it might be an efficient method, let’s examine an example from the literature. In a 2018 article ((Gray, R. (2018). Comparing cueing and constraints interventions for increasing launch angle in baseball batting. Sport, Exercise, and Performance Psychology, 7(3), 318-332. )), Rob Gray compared the CLA with more traditional methods for the training of experienced baseball batters. The focus was to increase their launch angle. The traditional methods consisted of giving technical cues and feedback (information about the ball’s launch angle, velocity, etc.). In one of the groups, the cues were focused on the body (“move your arms at an upward angle”, etc.), while in the other they focused away from the body (“contact the bottom half of the ball”, etc.). In contrast, the CLA group had to hit the ball over a barrier placed on the field. If the attempt was successful, the distance of the barrier was increased, and decreased if the attempt was unsuccessful.</p>\n<p><img src=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/images/silouhette-1024x626.png\" alt=\"\"></p>\n<p>Batting over a barrier</p>\n<p>After 6 weeks of training, the CLA group had higher launch angle and exit velocity, and achieved more fly balls and home runs than the other groups. The internal focus of attention (focusing on the body) group had the worst outcomes. This suggests that traditional methods inviting the practitioner to focus on minute technical details might lead to poor learning outcomes, and that the CLA is a good replacement candidate.</p>\n<p>Let’s examine a few of the characteristics of the CLA to understand better what sets it apart from other methods.</p>\n<p>The first point is that it considers the coach as an environment architect or designer, who directs learning by <strong>manipulating the constraints</strong> and information sources in the environment, rather than as an instructor whose role is to give instructions and feedback. Constraints are not used randomly, but in a systematic and intentional way, with a specific learning outcome in mind. Constraints set the boundaries for the most functional movement solutions, so making changes to constraints directs learning to new solutions. The chosen constraints invite (afford) certain behaviours, while excluding others. In our example, we see that having to overcome a barrier pushes the learners to adapt their movements, increasing their launch angle. Teaching is therefore all about channeling the learner to find optimal movement solutions as a result of body’s self-organization processes.  Other examples might be to change the rules of the game to encourage a certain type of passing in football practice, setting up cones to change stride length in athletics or moving obstacles to spark different types of parkour movements.</p>\n<p>As movement is based on information, it is important that information during practice is similar to information in the performance context (game, competition or “real-world” application). This means that practice environments and exercises should resemble performance environments. If not, there might be little to no transfer, meaning that what is learnt will not be applicable outside of the practice situation. We call this principle <strong>representative learning design</strong>. Our baseball example happened in a virtual simulation apparatus. Therefore it was not identical in all respects to a performance environment. But the important point is that the relevant information sources should be similar. A (well designed) simulated pitcher is probably not that bad, because you can use information from his (virtual) body to anticipate the movement of the ball, which you cannot do with a robot pitcher. For the same reasons, we should avoid breaking down skills into parts, because they might work differently when practiced in isolation than when used together.   As another example, small-sided games are usually better than closed drills as they maintain the aspect of following and adapting to the movements of other players (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )). Because we’re talking of self-organisation and adaptation, we want to make sure we are adapting in a way that is also functional outside of the artificial practice contexts.</p>\n<p>The CLA is not interested in one optimal technique, but in optimal outcome. Because every performer is unique, individually optimal movement solutions and techniques might be very different (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )) . Furthermore, as practice is not about replicating the correct technique, a great amount of variability and errors is therefore a natural and important part of learning. Practice sessions should be designed to provide enough possibilities for variety and enough room for trial and error (( Chow, J. Y., Davids, K., Button, C., Rein, R., Hristovski, R., &amp; Koh, M. (2009). Dynamics of multi-articular coordination in neurobiological systems. Nonlinear Dynamics Psychology and Life )). We call this principle <strong>repetition without repetition</strong>. The baseball players in the CLA group didn’t need to focus on reproducing a stereotypical pattern of movement. They could try different techniques while staying focused on their objective of sending the ball over the barrier. All means and resources could be used, as long as they served this objective.</p>\n<p>Because the CLA guides learning by modifying constraints rather than with explicit instructions, and because the focus is on the outcome, the attention of the practitioner is focused outside his body. This is called an <strong>external focus of attention</strong> and it is often considered more beneficial for learning (( Davids, K. W., Button, C., &amp; Bennett, S. J. (2008). Dynamics of skill acquisition: A constraints-led approach. Campaign, IL: Human Kinetics. )) (( Wulf, G., Höß, M., &amp; Prinz, W. (1998). Instructions for motor learning: Differential effects of internal versus external focus of attention. Journal of motor behavior, 30(2), 169-179 )). We already saw that in our baseball example, the external focus group had better learning outcomes than the internal focus group. The CLA harnesses this effect, while not simply boiling down to a traditional use of the external focus of attention, because it adds a layer: the manipulation of constraints.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\"><strong>Conclusion</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/brief-introduction-to-the-constraints-led-approach/\">#</a></h2>\n<p>The constraints-led approach is a tool for teachers and coaches to design effective motor skill practice. It is based on the idea that movement is guided by boundaries called constraints. As we perceive the environment in relation to our abilities and the task at hand, action follows. Action in turn changes what we perceive. The body is considered a complex system, that needs to self-organize in order to produce goal-oriented movements. This self-organization process requires practice with a lot of variability and exploration.</p>\n<p>Using the CLA means manipulating the constraints of the task, performer and environment in a systematic way, in order to invite skillful behaviour. The design of the training situation should be representative of the performance context, in order to facilitate skill transfer. The practice should allow for exploration, variability and trial-and-error, rather than focusing on repetitive drills meant to perfect an ideal, stereotypical technique.</p>\n",
			"date_published": "2019-08-12T00:00:00Z"
		}
		,
		{
			"id": "https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/",
			"url": "https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/",
			"title": "Affordances: Perception and Action",
			"content_html": "<blockquote>\n<p>''The affordances of the environment are what it offers the animal, what it provides or furnishes, either for good or ill. The verb to afford is found in the dictionary, the noun affordance is not. I have made it up. I mean by it something that refers to both the environment and the animal in a way that no existing term does. It implies the complementarity of the animal and the environment.''</p>\n<p>Gibson (1979, p.127)</p>\n</blockquote>\n<p>One of the most widely used theories from the Ecological Psychology framework is that of affordances. In short, affordances are action possibilities that the environment provides us. Affordances made their way from Ecological Psychology into various fields like sports coaching and movement sciences, to product design and artificial intelligence. Even people disagreeing with Ecological Psychology and direct perception have jumped on the Affordance wagon. What exactly is the concept of Affordances, why is it so widely applied and what does it offer the world of sports coaching?</p>\n<p>Ecological Psychology, that puts heavy emphasis on studying behaviour of biological systems within the context they are found in, makes two statements with regards to perception. Firstly, the environment provides us with rich visual information, that allows us to directly perceive the environment without interpretation thereof. Secondly, according to Gibson (The 'founder' of Ecological Psychology), our perception is directly linked to action. What we perceive are 'action possibilities', for which Gibson coined the term 'Affordance'. It is the theory of affordances that lays the foundation for sports coaching methodologies, but also other fields.</p>\n<p>Just saying that the environment gives us opportunities to act upon is fairly self-explanatory and straight forward, but wouldn't do justice the complexity of changing nature of the situation. This is because affordances exist as a relationship based on two entities: The individual who perceives the environment, and the environment itself. Affordances are part of the animal-environment system. ((Chemero, A. (2003). An Outline of a Theory of Affordances. <em>Ecological Psychology</em>, <em>15</em>(2), 181–195.)) ((Chemero, A. (n.d.). Radical Embodied Cognitive Science.)) (( Stoffregen, T. A. (2003). Affordances as Properties of the Animal-Environment System. <em>Ecological Psychology</em>, <em>15</em>(2), 115–134.))</p>\n<blockquote>\n<p>It is important to note that there are slight variations in how different people define affordances. This is even the case between us, the writers of the blog. As interesting as it is, these minor differences are not relevant for using this concept in sports, and differences will be pointed out where relevant.</p>\n</blockquote>\n<h2 id=\"effectivities\" tabindex=\"-1\"><strong>Effectivities</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/\">#</a></h2>\n<p>Firstly, animals (including humans) have vastly different abilities. For a bird, the sky affords flying, as it has wings. Humans are not able to fly without machines, but we have arms that allow us to throw objects in the same space birds can fly in. Thus, each species of animals has different affordances in the same environment. This difference in affordances is also present between individuals of the same species. A branch of a tree might afford someone to hang from it, if that person is strong enough to do so. You could not generalise to say that the tree branch affords hanging from, however, as someone else could have hands that are too small, or not enough strength to do so. Or maybe the branch is strong enough to hold a child, but not an adult.</p>\n<p>The abilities of an individual thus play a key role in the actualisation of affordances. The abilities of an individual are called 'effectivities', or 'organismic constraints'. ((Button, C., Davids, K &amp; Bennett, S. (2008). <em>Dynamics of Skill Acquisition: A constraints-led approach</em>.)) ((Chemero, A. (n.d.). Radical Embodied Cognitive Science.))The potential effectivities are specific to a species, but specific effectivities are highly individual and can change over time. These changes can be slow and long term, like learning new movement patterns or gaining muscle strength. This for example allows someone to carry more weight, jump higher or learn how to swim. Changes can also form limitations. A toddler is able to crawl through certain gaps that it can no longer crawl through when being a teenager, for example.</p>\n<p>The changes of effectivities can be much shorter term too, however. Imagine being able to lift a certain weight. If you're into strength training you'll know that after lifting that weight a few times in a row, you will not be able to do so anymore due to fatigue. Another example of a decrease in ability can happen due to emotional stress, like fear. In a study conducted on climbers, it was found that fear can actually decrease the physical ability to perform certain movements. Participants were asked to perform the same traverse, that had more hold than necessary, twice: once at ground level, and once a few meters off the ground. Even though they were secured with a rope, they made use of more holds on the higher route. In a similar experiment the participants perceived and actual vertical reach was measured on the climbing wall. While under pressure of fear both the perceived ability and the actual ability to reach was less. ((Pijpers, J., Oudejans, R., Bakker, F., &amp; Beek, P. (2006). The Role of Anxiety in Perceiving and Realizing Affordances. <em>Ecological Psychology</em>, <em>18</em>, 131–161.))</p>\n<h2 id=\"constraints\" tabindex=\"-1\"><strong>Constraints</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/\">#</a></h2>\n<p>Secondly, there is the environment. Just like an animal, the environment is subject to big changes over time. A steep grass hill for example can afford capable humans of walking up and down on a sunny day. Once it starts raining walking up and especially down becomes much more challenging, and a new affordance of sliding down the hill will arise. A tree branch might afford hanging on, but once the branch dies it would break if hanging would be attempted. Alternatively, a young tree might be too weak to support any significant weight, but after it grows sufficiently it might turn into a favourite climbing tree of the locals.</p>\n<p>There are various traits of the environment that are defining for action. They include the height, width and weight of objects, its textures and distance relative to each other or the individual. These defining traits are called 'constraints', or 'environmental constraints'. ((Button, C., Davids, K &amp; Bennett, S. (2008). <em>Dynamics of Skill Acquisition: A constraints-led approach</em>.)) ((Chemero, A. (2003). An Outline of a Theory of Affordances. <em>Ecological Psychology</em>, <em>15</em>(2), 181–195.)) ((Chemero, A. (n.d.). Radical Embodied Cognitive Science.))</p>\n<p>This word is slightly confusing, as in everyday life a constraint is something that limits. In the context of affordances constraints to pose limitations as well, but they are also enablers. To get back at the wet hill example, you could argue that the wet grass caused by rain has now limited the ability to walk, but you could equally argue that the dry hill has limited your ability to slide. Thus, constraints within this context shouldn't be seen as a positive or negative, but rather a neutral and defining characteristic.</p>\n<h2 id=\"affordances\" tabindex=\"-1\"><strong>Affordances</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/\">#</a></h2>\n<p>So now we can see that Affordances need two main elements: effectivities and constraints. Without the existence of either two elements, an affordance cannot be actualised. It is also important to understand that the two elements change over time, both rapidly and slowly. Affordances are a good example of a dynamical system within Ecological Psychology.</p>\n<blockquote>\n<p>Some people believe that the affordances exists in the environment regardless of the existence of a person to act upon. An individual merely actualises an affordance. Others (like myself), believe that an individual with relevant abilities are necessary for an affordance to exist. In this view, only constraints exist in the environment, and affordances are relational.</p>\n</blockquote>\n<p>Now that we understand affordances a bit better, we can loop back to perception. As mentioned earlier, according to Ecological Psychology perception is for action. Generally, what we perceive are affordances that are relevant to ourselves. It is possible to perceive affordances for others too, but it is crucial to understand the abilities of the other person for that.</p>\n<p>You can imagine that an environment provides us with almost immeasurable amounts of affordances. This could be quite overwhelming. You could even expect an overload of information that results in indecisiveness. This does happen in some people, but it would be considered a health problem. Generally speaking, however, we are able to perceive the affordances more relevant to us. This is because we are not fully rational in the way we perceive our environment, and much more emotional and intentional. The affordances we perceive are not only calibrated based on our effectivities and environmental constraints, but also our intentions and emotions, these can be called 'task constraints'. ((Button, C., Davids, K &amp; Bennett, S. (2008). <em>Dynamics of Skill Acquisition: A constraints-led approach</em>.)) For example, when you walk into your room after a long day of exercise and you see your chair, you will gladly sit down on it. If you had the tough luck of flicking your light switch and your light popped, the same chair could suddenly be seen as the perfect step-up to replace your light bulb. Based on what we require or desire to do, certain affordances will be more prominent and invite behaviour. These invitations that the affordances give make it easier to select which actions to undertake. The affordances that stand out more as being relevant to an individual at a given moment in time are called the Field of Affordances. ((Bruineberg, J., &amp; Rietveld, E. (2014). Self-organization, free energy minimization, and optimal grip on a field of affordances. <em>Frontiers in Human Neuroscience</em>, <em>8</em>.)) ((Withagen, R., Araujo, D., &amp; De Poel, H. (2017). Inviting affordances and agency. <em>New Ideas in Psychology</em>, <em>45</em>, 11–18.)) ((Withagen, R., De Poel, H., Araujo, D., &amp; Pepping, G.-J. (2012). Affordances can invite behavior: Reconsidering the relationship between affordances and agency. <em>New Ideas in Psychology</em>, <em>30</em>, 250–258.))</p>\n<p>This means quite literally that everyone perceives their environment differently, depending on our abilities. It also means the way we perceive our environment changes over time, provided that our abilities and intentions change. This change in perception of the environment has been measured in multiple studies. When a person intends to walk or run up a hill, that hill is perceived to be steeper and bigger when the individual is exhausted, compared to when the individual is fresh and full of energy. In a similar study, a wall that could not be climbed was overestimated in height, whereas the height was more accurately judged when it was climbable by the individual. Smaller objects can be perceived differently depending on skill level too: softball players that were better at hitting a ball perceive the ball as bigger than their less skilled counterparts. Even though we are able to perceive affordances for other, it seems that ultimately our own ability plays the biggest role in how we perceive the world. ((Bhalla, M., &amp; Proffitt, D. (1999). Visual-Motor recalibration in geographical slant perception. <em>Journal of Experimental Psychology. Human Perception and Performance</em>, <em>25</em>, 1076–1096.)) ((Taylor, J. E., Witt, J. K., &amp; Sugovic, M. (2011). When walls are no longer barriers: perception of wall height in parkour. <em>Perception</em>, <em>40</em>(6), 757–760.)) (( Witt, J. K., South, S. C., &amp; Sugovic, M. (2014). A perceiver’s own abilities influence perception, even when observing others. <em>Psychonomic Bulletin &amp; Review</em>, <em>21</em>(2), 384–389.)) ((Witt, J., &amp; Proffitt, D. (2005). See the Ball, Hit the Ball: Apparent Ball Size Is Correlated With Batting Average. <em>Psychological Science</em>, <em>16</em>, 937–938.))</p>\n<p>Experience in performing a task is crucial in learning how to perceive affordances. Before performing a task, it can be hard to accurately judge affordances. After gaining the physical experience in performing the task perception gets more accurate, which proves that perception and action feed into each other. ((Franchak, J. M., van der Zalm, D. J., &amp; Adolph, K. E. (2010). Learning by doing: Action performance facilitates affordance perception. <em>Vision Research</em>, <em>50</em>(24), 2758–2765.))</p>\n<h2 id=\"application-in-sports\" tabindex=\"-1\"><strong>Application in sports</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/\">#</a></h2>\n<p>As a sports coach, or a practitioner that self-coaches, understanding the theory of affordances is very useful. The first realisation is that in fact, the same environment is perceived differently by different individuals, and differently over time as well. The second realisation is that the environment plays a key role in the animal-environment system, so the way a training environment is designed can make or break how effective a training session will be.</p>\n<p>When you are creating a set-up for training you are effectively creating a Landscape of Affordances with the intention is to improve certain skills. What you ultimately need to get right, however, is the Field of Affordances for one or multiple students. This Field of Affordances will depend on the Landscape of Affordances, the effectivities of the student(s), and the task constraints. Not all students will have the same Field of Affordances! A set-up that works well to improve skill A for student A, may not work for student B. It is then important to assess whether the desired improvement can be achieved in student B by changing the task constraints, or by adapting environmental constraints. As a coach you will need to make sure that you adapt and cater for different individuals.</p>\n<h2 id=\"summary\" tabindex=\"-1\"><strong>Summary</strong> <a class=\"header-anchor\" href=\"https://senestres.github.io/adaptive-movement/blog/affordances-perception-and-action/\">#</a></h2>\n<p>Affordances are action possibilities in the environment. The available affordances vary for each individual and depend on the individual’s abilities, intentions and the characteristics of the environment. Our perception is mostly aimed at perceiving affordances, and the affordances we perceive are shaped by our abilities and prior experiences. When practising a sport, our environment has a big role in the way we will behave. As a sports coach we need to be aware that the way we design the training set-up is very important when shaping a training session, and we need to be aware that one single training set-up will have a different effect on each individual taking part in the session.</p>\n",
			"date_published": "2019-08-12T00:00:00Z"
		}
		
	]
}
